**DATAFRAME CREATION**

In [51]:
import pandas as pd

df = pd.read_excel('C:\\Users\\vivek\\qubryx\\python\\data.xlsx')

df.head(10)

,MODEL,COMPANY,CC,TORQUE,MILEAGE,PRICE,TYPE
0,Himalayan 450,Royal Enfield,411,32,30,3.06 - 3.20,Adventure
1,390 Adventure,KTM,373,37,25,3.68,Adventure
2,G 310 GS,BMW,313,28,30,3.3,Adventure
3,V-Strom SX,Suzuki,399,37,29,2.31,Adventure
4,Adventure,Yezdi,NaN,27,35,2.3,Adventure
5,390 Duke,KTM,373,37,26,NaN,Sports Naked
6,RC 390,KTM,373,35,28,3.22,Sports
7,Apache RR 310,TVS,312,27.3,30,2.56 - 3.11,Sports
8,G 310 RR,BMW,313,28,32,2.81,Sports
9,Interceptor 650,Royal Enfield,648,52,35,3.32 - 3.63,Classic/Cruiser

**CONVERTION**

In [3]:
import pandas as pd 

df = pd.read_excel('C:\\Users\\vivek\\qubryx\\python\\data.xlsx')

df.to_csv('C:\\Users\\vivek\\qubryx\\python\\data.csv', index=False)

In [4]:
import pandas as pd 
df = pd.read_excel('C:\\Users\\vivek\\qubryx\\python\\data.xlsx')
df.to_json('C:\\Users\\vivek\\qubryx\\python\\data.json', orient='records', lines=True)

**LOAD CSV & JSON**

In [5]:
#csv
import pandas as pd
dc = pd.read_csv('C:\\Users\\vivek\\qubryx\\python\\data.csv')
dc.head()

           MODEL        COMPANY   CC TORQUE MILEAGE        PRICE       TYPE
0  Himalayan 450  Royal Enfield  411     32      30  3.06 - 3.20  Adventure
1  390 Adventure            KTM  373     37      25         3.68  Adventure
2       G 310 GS            BMW  313     28      30          3.3  Adventure
3     V-Strom SX         Suzuki  399     37      29         2.31  Adventure
4      Adventure          Yezdi  NaN     27      35          2.3  Adventure

In [6]:
#json
dj = pd.read_json('C:\\Users\\vivek\\qubryx\\python\\data.json', lines=True)
print(dj.head())

           MODEL        COMPANY    CC TORQUE MILEAGE        PRICE       TYPE
0  Himalayan 450  Royal Enfield   411     32      30  3.06 - 3.20  Adventure
1  390 Adventure            KTM   373     37      25         3.68  Adventure
2       G 310 GS            BMW   313     28      30          3.3  Adventure
3     V-Strom SX         Suzuki   399     37      29         2.31  Adventure
4      Adventure          Yezdi  None     27      35          2.3  Adventure

**FILTERING,SORTING AND GROUPING**

In [38]:
#FILTERING

import pandas as pd

def filter_mileage(df):
    df['MILEAGE'] = pd.to_numeric(df['MILEAGE'])
    filtered_df = df[df['MILEAGE'] > 30]
    return filtered_df


filtered_data = filter_mileage(df)
print(filtered_data)

                 MODEL        COMPANY   CC       TORQUE  MILEAGE        PRICE  \
4            Adventure          Yezdi  NaN           27     35.0          2.3
8             G 310 RR            BMW  313           28     32.0         2.81
9      Interceptor 650  Royal Enfield  648           52     35.0  3.32 - 3.63
10  Continental GT 650  Royal Enfield  648           52     35.0  3.29 - 3.78
12         Shotgun 650  Royal Enfield  647           52     34.0  3.59 - 4.09
13          XPulse 421           Hero  411         37.5     35.0         ~2.5
19         Classic 350  Royal Enfield  346           30     35.0         1.93
21                 F77  Ultraviolette   EV  72 Nm (Est)     85.0  2.99 - 3.99
22        Hiness CB350          Honda  348           30     35.0          NaN
24         Xtreme 200S           Hero  199         18.1     40.0         1.41

               TYPE
4         Adventure
8            Sports
9   Classic/Cruiser
10       Cafe Racer
12          Cruiser
13        Adventure
19  Cruiser/Classic
21   Electric Sport
22   Modern Classic
24    Sports Tourer

In [ ]:
#SORTING

sorted_df = df.sort_values(by='MILEAGE')
sorted_df_desc = df.sort_values(by='MILEAGE', ascending=False)

sorted_df

,MODEL,COMPANY,CC,TORQUE,MILEAGE,PRICE,TYPE
16,X440,Harley Davidson,438,38.5,22.0,2.4,Cruiser
1,390 Adventure,KTM,373,37,25.0,3.68,Adventure
5,390 Duke,KTM,373,37,26.0,NaN,Sports Naked
6,RC 390,KTM,373,35,28.0,3.22,Sports
11,Ninja 300,Kawasaki,296,27,28.0,3.17 - 3.43,Sports
3,V-Strom SX,Suzuki,399,37,29.0,2.31,Adventure
0,Himalayan 450,Royal Enfield,411,32,30.0,3.06 - 3.20,Adventure
2,G 310 GS,BMW,313,28,30.0,3.3,Adventure
20,Zontes 350R,Zontes,348,30,30.0,2.57,Sports Naked
7,Apache RR 310,TVS,312,27.3,30.0,2.56 - 3.11,Sports
18,Jawa 42 Bobber,Jawa,293,NaN,30.0,1.95,Bobber/Cruiser
23,Perak,Jawa,334,28.5,30.0,2.16,Bobber/Cruiser
17,Dominar 400,Bajaj,373,35,30.0,2.3,Power Cruiser
14,Apache RTR 310,TVS,312,27.3,30.0,2.21,Sports Naked
15,Scrambler 400X,Triumph,399,NaN,30.0,2.68,Scrambler
8,G 310 RR,BMW,313,28,32.0,2.81,Sports
12,Shotgun 650,Royal Enfield,647,52,34.0,3.59 - 4.09,Cruiser
10,Continental GT 650,Royal Enfield,648,52,35.0,3.29 - 3.78,Cafe Racer
19,Classic 350,Royal Enfield,346,30,35.0,1.93,Cruiser/Classic
4,Adventure,Yezdi,NaN,27,35.0,2.3,Adventure
22,Hiness CB350,Honda,348,30,35.0,NaN,Modern Classic
13,XPulse 421,Hero,411,37.5,35.0,~2.5,Adventure
24,Xtreme 200S,Hero,199,18.1,40.0,1.41,Sports Tourer
9,Interceptor 650,Royal Enfield,648,52,NaN,3.32 - 3.63,Classic/Cruiser
21,F77,Ultraviolette,EV,72 Nm (Est),NaN,2.99 - 3.99,Electric Sport

In [36]:
#GROUPING

df['MILEAGE'] = pd.to_numeric(df['MILEAGE']).fillna(0).astype(float)
grouped = df['MILEAGE'].groupby(df['COMPANY'])  

print(grouped.mean())

COMPANY
BMW                31.000000
Bajaj              30.000000
Harley Davidson    22.000000
Hero               37.500000
Honda              35.000000
Jawa               30.000000
KTM                26.333333
Kawasaki           28.000000
Royal Enfield      33.800000
Suzuki             29.000000
TVS                30.000000
Triumph            30.000000
Ultraviolette      85.000000
Yezdi              35.000000
Zontes             30.000000
Name: MILEAGE, dtype: float64

**MERGING/JOINING**

In [40]:
#merging

import pandas as pd

data1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],}

data2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}

dd = pd.DataFrame(data1)

dd1 = pd.DataFrame(data2)

res = pd.merge(dd, dd1, on='key')

res

  key    Name  Age    Address Qualification
0  K0     Jai   27     Nagpur         Btech
1  K1  Princi   24     Kanpur           B.A
2  K2  Gaurav   22  Allahabad          Bcom
3  K3    Anuj   32    Kannuaj        B.hons

In [46]:
#joining

import pandas as pd


data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32]}

data2 = {'Address':['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'],
        'Qualification':['MCA', 'Phd', 'Bcom', 'B.hons']}

df = pd.DataFrame(data1,index=['K0', 'K1', 'K2', 'K3'])

df1 = pd.DataFrame(data2, index=['K0', 'K2', 'K3', 'K4'])

res = df.join(df1)

res

      Name  Age    Address Qualification
K0     Jai   27  Allahabad           MCA
K1  Princi   24        NaN           NaN
K2  Gaurav   22    Kannuaj           Phd
K3    Anuj   32  Allahabad          Bcom

In [47]:
res1 = df.join(df1, how='outer')

res1

      Name   Age    Address Qualification
K0     Jai  27.0  Allahabad           MCA
K1  Princi  24.0        NaN           NaN
K2  Gaurav  22.0    Kannuaj           Phd
K3    Anuj  32.0  Allahabad          Bcom
K4     NaN   NaN    Kannuaj        B.hons

In [48]:
import pandas as pd

data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Key':['K0', 'K1', 'K2', 'K3']}

data2 = {'Address':['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'],
        'Qualification':['MCA', 'Phd', 'Bcom', 'B.hons']}

df = pd.DataFrame(data1)

df1 = pd.DataFrame(data2, index=['K0', 'K2', 'K3', 'K4'])


res2 = df.join(df1, on='Key')

res2

     Name  Age Key    Address Qualification
0     Jai   27  K0  Allahabad           MCA
1  Princi   24  K1        NaN           NaN
2  Gaurav   22  K2    Kannuaj           Phd
3    Anuj   32  K3  Allahabad          Bcom

In [50]:
import pandas as pd

data1 = {'Name':['Jai', 'Princi', 'Gaurav'],
        'Age':[27, 24, 22]}

data2 = {'Address':['Allahabad', 'Kannuaj', 'Allahabad', 'Kanpur'],
        'Qualification':['MCA', 'Phd', 'Bcom', 'B.hons']}

df = pd.DataFrame(data1, index=pd.Index(['K0', 'K1', 'K2'], name='key'))

index = pd.MultiIndex.from_tuples([('K0', 'Y0'), ('K1', 'Y1'),('K2', 'Y2'), ('K2', 'Y3')],names=['key', 'Y'])

df1 = pd.DataFrame(data2, index= index)

result = df.join(df1, how='inner')

result

          Name  Age    Address Qualification
key Y
K0  Y0     Jai   27  Allahabad           MCA
K1  Y1  Princi   24    Kannuaj           Phd
K2  Y2  Gaurav   22  Allahabad          Bcom
    Y3  Gaurav   22     Kanpur        B.hons

**HANDLING MISSING VALUES**

In [53]:
#finding null value

print(df.notnull())

    MODEL  COMPANY     CC  TORQUE  MILEAGE  PRICE  TYPE
0    True     True   True    True     True   True  True
1    True     True   True    True     True   True  True
2    True     True   True    True     True   True  True
3    True     True   True    True     True   True  True
4    True     True  False    True     True   True  True
5    True     True   True    True     True  False  True
6    True     True   True    True     True   True  True
7    True     True   True    True     True   True  True
8    True     True   True    True     True   True  True
9    True     True   True    True     True   True  True
10   True     True   True    True     True   True  True
11   True     True   True    True     True   True  True
12   True     True   True    True     True   True  True
13   True     True   True    True     True   True  True
14   True     True   True    True     True   True  True
15   True     True   True   False     True   True  True
16   True     True   True    True     True   True  True
17   True     True   True    True     True   True  True
18   True     True   True   False     True   True  True
19   True     True   True    True     True   True  True
20   True     True   True    True     True   True  True
21   True     True   True    True     True   True  True
22   True     True   True    True     True  False  True
23   True     True   True    True     True   True  True
24   True     True   True    True     True   True  True

In [7]:
#Using dropna()
import pandas as pd

def drop_missing_rows(df):
    dfc = df.copy()
    dfc.dropna(inplace=True)
    return dfc


print(drop_missing_rows(df))

                 MODEL          COMPANY   CC       TORQUE       MILEAGE  \
0        Himalayan 450    Royal Enfield  411           32            30
1        390 Adventure              KTM  373           37            25
2             G 310 GS              BMW  313           28            30
3           V-Strom SX           Suzuki  399           37            29
6               RC 390              KTM  373           35            28
7        Apache RR 310              TVS  312         27.3            30
8             G 310 RR              BMW  313           28            32
10  Continental GT 650    Royal Enfield  648           52            35
11           Ninja 300         Kawasaki  296           27            28
12         Shotgun 650    Royal Enfield  647           52            34
13          XPulse 421             Hero  411         37.5            35
14      Apache RTR 310              TVS  312         27.3            30
16                X440  Harley Davidson  438         38.5            22
17         Dominar 400            Bajaj  373           35            30
19         Classic 350    Royal Enfield  346           30            35
20         Zontes 350R           Zontes  348           30            30
21                 F77    Ultraviolette   EV  72 Nm (Est)  85 km/charge
23               Perak             Jawa  334         28.5            30
24         Xtreme 200S             Hero  199         18.1            40

          PRICE             TYPE
0   3.06 - 3.20        Adventure
1          3.68        Adventure
2           3.3        Adventure
3          2.31        Adventure
6          3.22           Sports
7   2.56 - 3.11           Sports
8          2.81           Sports
10  3.29 - 3.78       Cafe Racer
11  3.17 - 3.43           Sports
12  3.59 - 4.09          Cruiser
13         ~2.5        Adventure
14         2.21     Sports Naked
16          2.4          Cruiser
17          2.3    Power Cruiser
19         1.93  Cruiser/Classic
20         2.57     Sports Naked
21  2.99 - 3.99   Electric Sport
23         2.16   Bobber/Cruiser
24         1.41    Sports Tourer

In [8]:
#using fill
def fill_missing_rows(dc):
    dcc = dc.copy()
    dcc.fillna(0, inplace=True)  
    return dcc

print(fill_missing_rows(dc))

                 MODEL          COMPANY   CC       TORQUE       MILEAGE  \
0        Himalayan 450    Royal Enfield  411           32            30
1        390 Adventure              KTM  373           37            25
2             G 310 GS              BMW  313           28            30
3           V-Strom SX           Suzuki  399           37            29
4            Adventure            Yezdi    0           27            35
5             390 Duke              KTM  373           37            26
6               RC 390              KTM  373           35            28
7        Apache RR 310              TVS  312         27.3            30
8             G 310 RR              BMW  313           28            32
9      Interceptor 650    Royal Enfield  648           52             0
10  Continental GT 650    Royal Enfield  648           52            35
11           Ninja 300         Kawasaki  296           27            28
12         Shotgun 650    Royal Enfield  647           52            34
13          XPulse 421             Hero  411         37.5            35
14      Apache RTR 310              TVS  312         27.3            30
15      Scrambler 400X          Triumph  399            0            30
16                X440  Harley Davidson  438         38.5            22
17         Dominar 400            Bajaj  373           35            30
18      Jawa 42 Bobber             Jawa  293            0            30
19         Classic 350    Royal Enfield  346           30            35
20         Zontes 350R           Zontes  348           30            30
21                 F77    Ultraviolette   EV  72 Nm (Est)  85 km/charge
22        Hiness CB350            Honda  348           30            35
23               Perak             Jawa  334         28.5            30
24         Xtreme 200S             Hero  199         18.1            40

          PRICE             TYPE
0   3.06 - 3.20        Adventure
1          3.68        Adventure
2           3.3        Adventure
3          2.31        Adventure
4           2.3        Adventure
5             0     Sports Naked
6          3.22           Sports
7   2.56 - 3.11           Sports
8          2.81           Sports
9   3.32 - 3.63  Classic/Cruiser
10  3.29 - 3.78       Cafe Racer
11  3.17 - 3.43           Sports
12  3.59 - 4.09          Cruiser
13         ~2.5        Adventure
14         2.21     Sports Naked
15         2.68        Scrambler
16          2.4          Cruiser
17          2.3    Power Cruiser
18         1.95   Bobber/Cruiser
19         1.93  Cruiser/Classic
20         2.57     Sports Naked
21  2.99 - 3.99   Electric Sport
22            0   Modern Classic
23         2.16   Bobber/Cruiser
24         1.41    Sports Tourer

In [9]:
#Using ffill and bfill

def ffill_missing_rows(dc):
    dcc = dc.copy()
    dcc.ffill(inplace=True)
    return dcc

print(ffill_missing_rows(dc))

                 MODEL          COMPANY   CC       TORQUE       MILEAGE  \
0        Himalayan 450    Royal Enfield  411           32            30
1        390 Adventure              KTM  373           37            25
2             G 310 GS              BMW  313           28            30
3           V-Strom SX           Suzuki  399           37            29
4            Adventure            Yezdi  399           27            35
5             390 Duke              KTM  373           37            26
6               RC 390              KTM  373           35            28
7        Apache RR 310              TVS  312         27.3            30
8             G 310 RR              BMW  313           28            32
9      Interceptor 650    Royal Enfield  648           52            32
10  Continental GT 650    Royal Enfield  648           52            35
11           Ninja 300         Kawasaki  296           27            28
12         Shotgun 650    Royal Enfield  647           52            34
13          XPulse 421             Hero  411         37.5            35
14      Apache RTR 310              TVS  312         27.3            30
15      Scrambler 400X          Triumph  399         27.3            30
16                X440  Harley Davidson  438         38.5            22
17         Dominar 400            Bajaj  373           35            30
18      Jawa 42 Bobber             Jawa  293           35            30
19         Classic 350    Royal Enfield  346           30            35
20         Zontes 350R           Zontes  348           30            30
21                 F77    Ultraviolette   EV  72 Nm (Est)  85 km/charge
22        Hiness CB350            Honda  348           30            35
23               Perak             Jawa  334         28.5            30
24         Xtreme 200S             Hero  199         18.1            40

          PRICE             TYPE
0   3.06 - 3.20        Adventure
1          3.68        Adventure
2           3.3        Adventure
3          2.31        Adventure
4           2.3        Adventure
5           2.3     Sports Naked
6          3.22           Sports
7   2.56 - 3.11           Sports
8          2.81           Sports
9   3.32 - 3.63  Classic/Cruiser
10  3.29 - 3.78       Cafe Racer
11  3.17 - 3.43           Sports
12  3.59 - 4.09          Cruiser
13         ~2.5        Adventure
14         2.21     Sports Naked
15         2.68        Scrambler
16          2.4          Cruiser
17          2.3    Power Cruiser
18         1.95   Bobber/Cruiser
19         1.93  Cruiser/Classic
20         2.57     Sports Naked
21  2.99 - 3.99   Electric Sport
22  2.99 - 3.99   Modern Classic
23         2.16   Bobber/Cruiser
24         1.41    Sports Tourer

In [10]:
#using bfill
def bfill_missing_rows(dc):
    dcc = dc.copy()
    dcc.bfill(inplace=True)
    return dcc

print(bfill_missing_rows(dc))

                 MODEL          COMPANY   CC       TORQUE       MILEAGE  \
0        Himalayan 450    Royal Enfield  411           32            30
1        390 Adventure              KTM  373           37            25
2             G 310 GS              BMW  313           28            30
3           V-Strom SX           Suzuki  399           37            29
4            Adventure            Yezdi  373           27            35
5             390 Duke              KTM  373           37            26
6               RC 390              KTM  373           35            28
7        Apache RR 310              TVS  312         27.3            30
8             G 310 RR              BMW  313           28            32
9      Interceptor 650    Royal Enfield  648           52            35
10  Continental GT 650    Royal Enfield  648           52            35
11           Ninja 300         Kawasaki  296           27            28
12         Shotgun 650    Royal Enfield  647           52            34
13          XPulse 421             Hero  411         37.5            35
14      Apache RTR 310              TVS  312         27.3            30
15      Scrambler 400X          Triumph  399         38.5            30
16                X440  Harley Davidson  438         38.5            22
17         Dominar 400            Bajaj  373           35            30
18      Jawa 42 Bobber             Jawa  293           30            30
19         Classic 350    Royal Enfield  346           30            35
20         Zontes 350R           Zontes  348           30            30
21                 F77    Ultraviolette   EV  72 Nm (Est)  85 km/charge
22        Hiness CB350            Honda  348           30            35
23               Perak             Jawa  334         28.5            30
24         Xtreme 200S             Hero  199         18.1            40

          PRICE             TYPE
0   3.06 - 3.20        Adventure
1          3.68        Adventure
2           3.3        Adventure
3          2.31        Adventure
4           2.3        Adventure
5          3.22     Sports Naked
6          3.22           Sports
7   2.56 - 3.11           Sports
8          2.81           Sports
9   3.32 - 3.63  Classic/Cruiser
10  3.29 - 3.78       Cafe Racer
11  3.17 - 3.43           Sports
12  3.59 - 4.09          Cruiser
13         ~2.5        Adventure
14         2.21     Sports Naked
15         2.68        Scrambler
16          2.4          Cruiser
17          2.3    Power Cruiser
18         1.95   Bobber/Cruiser
19         1.93  Cruiser/Classic
20         2.57     Sports Naked
21  2.99 - 3.99   Electric Sport
22         2.16   Modern Classic
23         2.16   Bobber/Cruiser
24         1.41    Sports Tourer

In [ ]:
# replace
import numpy as np

df = df.replace(to_replace=np.nan, value=99)
print(df[0:24])

                 MODEL          COMPANY   CC       TORQUE  MILEAGE  \
0        Himalayan 450    Royal Enfield  411           32       30
1        390 Adventure              KTM  373           37       25
2             G 310 GS              BMW  313           28       30
3           V-Strom SX           Suzuki  399           37       29
4            Adventure            Yezdi  -99           27       35
5             390 Duke              KTM  373           37       26
6               RC 390              KTM  373           35       28
7        Apache RR 310              TVS  312         27.3       30
8             G 310 RR              BMW  313           28       32
9      Interceptor 650    Royal Enfield  648           52       35
10  Continental GT 650    Royal Enfield  648           52       35
11           Ninja 300         Kawasaki  296           27       28
12         Shotgun 650    Royal Enfield  647           52       34
13          XPulse 421             Hero  411         37.5       35
14      Apache RTR 310              TVS  312         27.3       30
15      Scrambler 400X          Triumph  399          -99       30
16                X440  Harley Davidson  438         38.5       22
17         Dominar 400            Bajaj  373           35       30
18      Jawa 42 Bobber             Jawa  293          -99       30
19         Classic 350    Royal Enfield  346           30       35
20         Zontes 350R           Zontes  348           30       30
21                 F77    Ultraviolette   EV  72 Nm (Est)       85
22        Hiness CB350            Honda  348           30       35
23               Perak             Jawa  334         28.5       30

          PRICE             TYPE
0   3.06 - 3.20        Adventure
1          3.68        Adventure
2           3.3        Adventure
3          2.31        Adventure
4           2.3        Adventure
5           -99     Sports Naked
6          3.22           Sports
7   2.56 - 3.11           Sports
8          2.81           Sports
9   3.32 - 3.63  Classic/Cruiser
10  3.29 - 3.78       Cafe Racer
11  3.17 - 3.43           Sports
12  3.59 - 4.09          Cruiser
13         ~2.5        Adventure
14         2.21     Sports Naked
15         2.68        Scrambler
16          2.4          Cruiser
17          2.3    Power Cruiser
18         1.95   Bobber/Cruiser
19         1.93  Cruiser/Classic
20         2.57     Sports Naked
21  2.99 - 3.99   Electric Sport
22          -99   Modern Classic
23         2.16   Bobber/Cruiser

**AGGREGATION**

In [59]:

df['CC'] = pd.to_numeric(df['CC'], errors='coerce').fillna(0).astype(float)
df['MILEAGE'] = pd.to_numeric(df['MILEAGE'], errors='coerce').fillna(0).astype(float)
df['PRICE'] = pd.to_numeric(df['PRICE'], errors='coerce').fillna(0).astype(float)


aggregation = df.groupby('COMPANY').agg({
    'CC': ['mean', 'min', 'max'],
    'MILEAGE': ['mean', 'min', 'max'],
    'PRICE': ['mean', 'min', 'max'],
})

print(aggregation)

                    CC                  MILEAGE               PRICE         \
                  mean    min    max       mean   min   max    mean    min
COMPANY
BMW              313.0  313.0  313.0  31.000000  30.0  32.0   3.055   2.81
Bajaj            373.0  373.0  373.0  30.000000  30.0  30.0   2.300   2.30
Harley Davidson  438.0  438.0  438.0  22.000000  22.0  22.0   2.400   2.40
Hero             305.0  199.0  411.0  37.500000  35.0  40.0   0.705   0.00
Honda            348.0  348.0  348.0  35.000000  35.0  35.0 -99.000 -99.00
Jawa             313.5  293.0  334.0  30.000000  30.0  30.0   2.055   1.95
KTM              373.0  373.0  373.0  26.333333  25.0  28.0 -30.700 -99.00
Kawasaki         296.0  296.0  296.0  28.000000  28.0  28.0   0.000   0.00
Royal Enfield    540.0  346.0  648.0  33.800000  30.0  35.0   0.386   0.00
Suzuki           399.0  399.0  399.0  29.000000  29.0  29.0   2.310   2.31
TVS              312.0  312.0  312.0  30.000000  30.0  30.0   1.105   0.00
Triumph          399.0  399.0  399.0  30.000000  30.0  30.0   2.680   2.68
Ultraviolette      0.0    0.0    0.0  85.000000  85.0  85.0   0.000   0.00
Yezdi            -99.0  -99.0  -99.0  35.000000  35.0  35.0   2.300   2.30
Zontes           348.0  348.0  348.0  30.000000  30.0  30.0   2.570   2.57


                   max
COMPANY
BMW               3.30
Bajaj             2.30
Harley Davidson   2.40
Hero              1.41
Honda           -99.00
Jawa              2.16
KTM               3.68
Kawasaki          0.00
Royal Enfield     1.93
Suzuki            2.31
TVS               2.21
Triumph           2.68
Ultraviolette     0.00
Yezdi             2.30
Zontes            2.57